Autodesk.Revit.DB.SlabEdgeTypeSet
A set that contains slab edge types.

Autodesk.Revit.DB.SlabEdgeTypeSet.Insert(Autodesk.Revit.DB.SlabEdgeType)
System.Int32
Insert the specified slab edge type into the set.
item: The slab edge type to be inserted into the set.
Returns: Returns whether the slab edge type was inserted into the set.

Autodesk.Revit.DB.SlabEdgeTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.SlabEdgeTypeSet.ReverseIterator
Autodesk.Revit.DB.SlabEdgeTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.SlabEdgeTypeSet.ForwardIterator
Autodesk.Revit.DB.SlabEdgeTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.SlabEdgeTypeSet.Erase(Autodesk.Revit.DB.SlabEdgeType)
System.Int32
Removes a specified slab edge type from the set.
item: The slab edge type to be erased.
Returns: The number of slab edge types that were erased from the set.

Autodesk.Revit.DB.SlabEdgeTypeSet.Contains(Autodesk.Revit.DB.SlabEdgeType)
System.Boolean
Tests for the existence of a slab edge type within the set.
item: The slab edge type to be searched for.
Returns: The Contains method returns True if the slab edge type is within the set, otherwise False.

Autodesk.Revit.DB.SlabEdgeTypeSet.Clear
void
Removes every slab edge type from the set, rendering it empty.

Autodesk.Revit.DB.SlabEdgeTypeSet.Size
System.Int32
get
Returns the number of slab edge types that are in the set.

Autodesk.Revit.DB.SlabEdgeTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.